
&НаСервере
Процедура ТСПриИзмененииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
		Объект.Водитель = Объект.ТС.Водитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	ТСПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки1НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки1(Команда)
	КомандаВыборКолонки1НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки2НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки2(Команда)
	КомандаВыборКолонки2НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки3НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки3(Команда)
	КомандаВыборКолонки3НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыборКолонки4НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКолонки4(Команда)
	КомандаВыборКолонки4НаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаГотовностьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотовность(Команда)
	КомандаГотовностьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОстановкиОтпускаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаОстановкиОтпуска(Команда)
	КомандаОстановкиОтпускаНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗавершитьОтпускНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьОтпуск(Команда)
	КомандаЗавершитьОтпускНаСервере();
КонецПроцедуры


