
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Согра_Зарпавки 
	Движения.Согра_Зарпавки.Записывать = Истина;
	Движение = Движения.Согра_Заправки.Добавить();
	Движение.Период = Дата;
	Движение.ТС = ТС;
	Движение.ВидТоплива = ВидТоплива;
	Движение.Объем = Объем;
	Движение.Водитель = Водитель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
